{"result": 100, "data": {"retcode": 0, "code": 0, "subcode": 0, "lyric": "[ti:Snow On Tha Bluff (Explicit)]\n[ar:J. Cole]\n[al:Snow On Tha Bluff (Explicit)]\n[by:]\n[offset:0]\n[00:00.00]Snow On Tha Bluff (Explicit) - J. Cole\n[00:08.35]Lyrics by：J. Cole/Kenny Wooten\n[00:16.70]Composed by：J. Cole/Kenny Wooten\n[00:25.05]N***as be thinkin&apos; I&apos;m deep intelligent fooled by my college degree\n[00:27.90]My IQ is average there&apos;s a young lady out there\n[00:29.94]She way smarter than me\n[00:31.19]I scrolled through her timeline in these wild times\n[00:33.01]And I started to read\n[00:34.27]She mad at these crackers she mad at these capitalists\n[00:35.96]Mad at these murder police\n[00:37.38]She mad at my n***as she mad at our ignorance\n[00:39.10]She wear her heart on her sleeve\n[00:40.70]She mad at the celebrities lowkey I be thinkin&apos; she talkin&apos; &apos;bout me\n[00:43.76]Now I ain&apos;t no dummy to think I&apos;m above criticism\n[00:45.67]So when I see something that&apos;s valid I listen\n[00:47.36]But s**t it&apos;s something about the queen tone that&apos;s bothering me\n[00:50.05]She strike me as somebody blessed enough to grow up in conscious environment\n[00:53.14]With parents that know &apos;bout the struggle for liberation\n[00:55.15]And in turn they provide her with\n[00:56.45]A perspective and awareness of the system and unfairness that afflicts &apos;em\n[01:00.19]And the clearest understandin&apos; of what we gotta do to get free\n[01:02.75]And the frustration the fills her words seems to come from the fact\n[01:05.22]That most people don&apos;t see\n[01:05.95]Just &apos;cause you woke and I&apos;m not\n[01:07.07]That s**t ain&apos;t no reason to talk like you better than me\n[01:09.15]How you gon&apos; lead when you attacking the very same n***as\n[01:11.38]That really do need the s**t that you saying\n[01:12.97]Instead of conveying you holier come help get us up to speed\n[01:15.47]S**t it&apos;s a reason it took like two hundred years for our ancestors\n[01:17.85]Just to get freed\n[01:18.48]These shackles be lockin&apos; the mental way more than the physical\n[01:20.53]I look at freedom like trees can&apos;t grow a forest like overnight\n[01:23.08]Hit the ghetto and slowly start plantin&apos; your seeds\n[01:24.87]F**k is the point of you preaching your message to those\n[01:26.92]That already believe what you believe\n[01:28.06]I&apos;m on some &quot;F**k a retweet&quot; most people is sheep\n[01:29.94]You got all the answers but how you gon&apos; reach\n[01:31.52]If I could make one more suggestion respectfully\n[01:33.25]I would say it&apos;s more effective to treat people like children\n[01:35.82]Understandin&apos; the time and love and patience that&apos;s needed to grow\n[01:38.21]This change is inevitable but ain&apos;t none of us seen this before\n[01:40.76]Therefore we just gotta learn everything as we go\n[01:42.55]I struggle with thoughts on the daily\n[01:43.84]Feel like a slave that somehow done saved enough coins\n[01:45.84]To buy his way up outta slavery\n[01:47.01]Thinkin&apos; just maybe\n[01:47.77]In my pursuit to make life so much better for me and my babies\n[01:50.19]I done betrayed the very same people\n[01:51.73]That look at me like I&apos;m some kind of a hero\n[01:53.46]Because of the zeros that&apos;s next to the commas\n[01:54.95]But look here I promise I&apos;m not who you think\n[01:56.45]Ran into this n***a outside of the store yesterday\n[01:58.21]He said something that had me like &quot;Wait&quot;\n[01:59.75]He was like &quot;Cole &apos;preciate what you been doin&apos; my n***a that&apos;s real&quot;\n[02:02.37]But d**n why I feel faker than Snow on Tha Bluff\n[02:04.36]Well maybe &apos;cause deep down I know I ain&apos;t doing enough\n[02:18.84]The sun is shinin&apos; today\n[02:31.61]The sun is shinin&apos; today\n[02:44.16]The sun is shinin&apos; today\n[02:56.99]Can you walk with me\n[02:58.85]I hope we&apos;ll find the reason why we often sob go on cry\n[03:03.20]Painful memories f**k up the vibe\n[03:06.20]Though I be tryin&apos; to let the time heal my mind\n[03:09.55]I was once a child I&apos;ve gotten older\n[03:12.62]Still I know I&apos;m just a boy in God&apos;s eyes\n[03:15.90]Fill me up with wisdom and some courage\n[03:18.94]Plus endurance to survive\n[03:21.12]Help mine thrive", "trans": ""}}